package TreeBasicInfo;

/**
 * @program: dataStructure
 * @author: yjl
 * @created: 2021/12/15
 *
 * 树的基本概念
 * 节点：
 * 根节点：一个树只有一个根节点
 * 父节点：一个节点a头上另外一个节点b，则节点b就是节点a的父节点
 * 字节点：一个节点a下面有其他的节点（b、c、d）等其他节点，则节点b、节点c、节点d等其他节点都属于节点a的字节点
 * 兄弟节点：一个节点a下面有不同的节点（节点b、节点c、节点d），则节点b是节点c和节点d的兄弟节点
 *
 * 空树：一个树没有任何节点
 *
 * 子树：根节点下面的节点有其他的子节点，则称为子树
 * 左子树：以根节点左边的节点，为根，则为左子树
 * 右子树：以根节点右边的节点，为根，则为右子树
 *
 * 节点的度
 *
 * 树的度
 *
 * 叶子节点
 *
 * 层数
 *
 * 节点的深度
 *
 * 节点的高度
 *
 * 树的高度
 * 树的深度
 *
 *
 */
public class Tree {

    public static void main(String[] args) {

    }


}
